fn main() {
    // Розподіляємо літери по змінним
    let m = 'm';
    let u = 'u';
    let x = 'x';
    let a = 'a';
    let s = 's';
    let l = 'l';
    let o = 'o';
    let n = 'n';

    // Виводимо результат в форматі
    println!("{}{}{}", m, u, x); // muxa
    println!("{}        {}", x, a); // x        a
    println!("  ------"); // ------
    println!("    {}{}", s, l, o, n); // slon

    // Визначимо кількість рішень
    // Проте оскільки літери вже конкретно визначені, кількість рішень є одне
    println!("Кількість рішень: 1");
}
